# Задача 3. Билети за снукър
# С наближаването на световното първенство по снукър в театъра Крусибъл в Шефилд, Англия,
# феновете нямат търпение да се сдобият с ценните билети. Заради големия наплив от хора,
# организаторите ви молят да напишете програма за продаване на билети, като се има предвид следния ценоразпис:
#               Четвъртфинал	Полуфинал	    Финал
# Стандартен	55.50 £/бр.	    75.88 £/бр.	    110.10 £/бр.
# Премиум	    105.20 £/бр.	125.22 £/бр.	160.66 £/бр.
# ВИП	        118.90 £/бр.	300.40 £/бр.	400 £/бр.

# При закупуване на билет, зрителят може да избере опция, снимка с трофея, на цена 40 лири.

# При достигане на определена сума има отстъпки:
# •	Над 4000 лири има 25% отстъпка и безплатни снимки с трофея
# (ако  опцията за снимки е избрана, таксата от 40 лири за билет не се включва)

# •	Над 2500 лири има 10% отстъпка
# При избрана опция за снимки с трофея, цената се начислява след изчисляването на отстъпките.

# Обяснения
# Цената за един премиум билет за финал е 160.66 лири.
# Цената за 25 билета е: 160.66 * 25 = 4016.5 лири
# 4016.5 > 4000, следователно зрителят получава безплатни снимки с трофея и 25% отстъпка от цената.
# 25% от 4016.5 е 3012.375.
# Зрителят е избрал опцията за снимка с трофея, но тъй като вече е получил безплатни снимки, към цената не добавяме допълнителна такса.

# Вход
# От конзолата се четат 3 реда:
# 1.	Етап на първенството – текст - “Quarter final ”, “Semi final” или “Final”
# 2.	Вид на билета – текст - “Standard”, “Premium” или “VIP”
# 3.	Брой билети – цяло число в интервала [1 … 30]
# 4.	Снимка с трофея – символ – 'Y' (да) или 'N' (не)
# Изход
# На конзолата се отпечатва 1 ред:
# •	"Цената, която трябва да се заплати, форматирана до втората цифра след десетичния знак"
