# Задача 5. Филмов рейтинг
# Деси много обича да гледа филми, но често й е трудно да си избере подходящ за гледане. Набелязва си определен брой филми и иска да си избере кой филм да гледа спрямо рейтинга на филмите.
# Напишете програма, която показва кой филм е с най-висок рейтинг, кой е с най-нисък и колко е средният рейтинг от всички филми, които си е набелязала да гледа.
# Вход
# От конзолата първо се чете един ред:
# •	Брой филми, които си е набелязала Деси – цяло число в интервала [1…20]
# За всеки филм се прочитат два отделни реда:
# •	Име на филма – текст
# •	Рейтинг на филма - реално число в интервала [1.00…10.00]

# Обяснения
# 5 набелязани филма
# Филмът с максимален рейтинг е:
# A Star is Born с рейтинг 7.8
# Филмът с минимален рейтинг е:
# Captain Marvel с рейтинг 7.1
# Средният рейтинг е:
# (7.8 + 7.3 + 7.2 + 7.2 + 7.1) / 5 = 36.5 / 5 = 7.32 ~ 7.3

# Изход
# Отпечатват се три реда в следния формат:
# •	"{име на филма с най-висок рейтинг} is with highest rating: {рейтинг на филма}"
# •	"{име на филма с най-нисък рейтинг} is with lowest rating: {рейтинг на филма}"
# •	"Average rating: {средният рейтинг на всички филми}"
# Максималният, минималният и средният рейтинг да се форматира до първата цифра след десетичния знак.

movies_num = int(input())
max_rate = 1.0
min_rate = 10.0
total_rating = 0

max_movie = ''
min_movie = ''

for movie in range(movies_num):
    ime_movie = input()
    rating = float(input())

    if rating > max_rate:
        max_rate = rating
        max_movie = ime_movie

    if rating < min_rate:
        min_rate = rating
        min_movie = ime_movie
    
    total_rating += rating
    
average = total_rating / movies_num
print(f'{max_movie} is with highest rating: {max_rate:.1f}')
print(f'{min_movie} is with lowest rating: {min_rate:.1f}')
print(f'Average rating: {average:.1f}')
