# Задача 6. Коледна украса
# Семейство Иванови решават да подменят коледната украса в своя дом и да поръчат нова по интернет.
# Вашата задача е да напишете програма, която изчислява, дали бюджетът ще им стигне за украсата.
# Цената на всеки предмет ще представялва сумата от ASCII кодовете на всяка буква от думата.

# Вход
# Първия ред от входа представлява:
# •	Бюджетът за украсата - цяло число в интервала [1 … 50000]
# След това се четат поредица от редове до получаване на команда "Stop":
# •	Име на предмет - текст

# Обяснения
# Бюджетът, с който разполагаме е 3000лв.
# Цената на първата украса се образува от ASCII стойностите за всеки символ (s + t + a + r) = 442 <= 3000,
# следователно я купуваме. Остават ни 3000 – 442 = 2558 лв.
# …
# Цената на четвъртия артикул е 970, а останалият бюджет е 497, няма достатъчно средства и програмата приключва работа

# Изход
# При успешна покупка (т.е ако цената на предмета е по-малка или равна на наличните пари), на конзолата да се отпечата:
# •	"Item successfully purchased!"
# При неуспешна покупка (т.е ако цената е по-голяма от останалите пари), да се отпечата:
# •	"Not enough money!" и програмата да приключи
# При получаване на команда "Stop", на конзолата да се отпечата:
# •	"Money left: {останалият бюджет}" и програмата да приключи

budget = int(input())
command = input()
expenses = 0

while command != 'Stop':
    current_name_sum = 0

    for letter in command:
        current_name_sum += ord(letter)

    expenses += current_name_sum
    if expenses <= budget:
        print('Item successfully purchased!')
    else:
        print('Not enough money!')
        break

    command = input()


if command == 'Stop':
    diff = abs(budget - expenses)
    print(f'Money left: {diff}')