# 05. Автобус

# Вход
# Входът се чете от конзолата и съдържа:
# •	На първия ред - броят пътници в автобуса при потеглянето му - цяло число в интервала [1 ... 100]
# •	На втория ред - броят на спирките - цяло число в интервала [1…50]
# •	На следващите редове (равни на броят на спирките * 2) - броя на пътниците,
# които слизат и броя на пътниците които се качват - цели числа в интервала [0…100]

# На всяка спирка се качват и слизат определен брой пътници.
#
# Броят на спирките се въвежда от конзолата.

# Също така, на всеки нечетен брой спирки се качват по двама проверяващи и слизат на четните спирки.

# Изход
# Да се отпечата на конзолата 1 ред :
# "The final number of passengers is : {брой пътници при пристигането}"

passengers = int(input())
broi_spirki = int(input())
slizat = 0
kachvat = 0


for spirka in range(1, broi_spirki + 1):
    if not spirka % 2 == 0:
        slizat = int(input())
        kachvat = int(input()) + 2
    else:
        slizat = int(input()) + 2
        kachvat = int(input())

    passengers -= slizat
    passengers += kachvat


print(f"The final number of passengers is : {passengers}")